# 2. 파이썬 기초
## 2.2 데이터 타입
### 2.2.2 문자열
---

In [20]:
"Hello World"

'Hello World'

In [21]:
'Hello World'

'Hello World'

In [17]:
"""퀀트 투자 포트폴리오 만들기"""

'퀀트 투자 포트폴리오 만들기'

In [16]:
'''퀀트 투자 포트폴리오 만들기'''

'퀀트 투자 포트폴리오 만들기'

In [3]:
# 따옴표를 3 개 사용할 경우 줄 바꿈을 통해 여러 줄의 문자열을 만들 수 있다.
multiline = """ Life is too short 
You need python""" 

print(multiline)

 Life is too short
You need python

In [4]:
# 문자열 맨 앞에 f를 붙이면 f-string 포매팅이 선언되며, 중괄호 안에 
# 변수를 넣으면 해당 부분에 변수의 값이 입력 된다 .
name = '조문수'
birth = '1984' 

f'나의 이름은 {name}이며, {birth}년에 태어났습니다.'

'나의 이름은 조문수이며, 1984년에 태어났습니다.'

In [1]:
# 문자열 길이 구하기: len()
a = 'Life is too short' 
len(a)

17

In [2]:
# 문자열 치환하기: replace()
# 문자열.replace(a, b): a를 b로 치환
var = '퀀트 투자 포트폴리오 만들기' 
var.replace (' ', '_')

'퀀트_투자_포트폴리오_만들기'

In [5]:

# 문자열 나누기: split()
var = '퀀트 투자 포트폴리오 만들기' 
var.split(' ')

['퀀트', '투자', '포트폴리오', '만들기']

In [6]:
# 문자열 인덱싱(파이썬은 숫자가 0부터 시작 → 2는 세번째 문자)
var = 'Quant'
var[2]

'a'

In [7]:
# 인덱싱에 마이너스(-) 기호를 붙이면 문자열 뒤에서 부터 읽는다.
var[-2]

'n'

In [8]:
# 슬라이싱 var[시작:마지막], 이때 마지막 번호는 미포함
# var[0:3] → 0이상 3미만(첫번째 부터 세번째 까지)
var[:3]

[1, 2, 3]

In [26]:
var[3:]

[4]

### 2.2.3 리스트
---

In [15]:
# 리스트: 연속된 데이터 표현, 대괄호([]) 이용해 생성
# 리스트_숫자
list_num = [1, 2, 3]
print(list_num)

[1, 2, 3]

In [16]:
# 리스트_문자열
list_char = ['a', 'b', 'c']
print(list_char)

['a', 'b', 'c']

In [17]:
# 리스트_복합
list_complex = [1, 'a', 2]
print(list_complex)

[1, 'a', 2]

In [18]:
# 리스트_중첩
list_nest = [1, 2, ['a', 'b']]
print(list_nest)

[1, 2, ['a', 'b']]

In [19]:
# 리스트 인덱싱
var = [1, 2, ['a', 'b', 'c']]
var[0]

1

In [20]:
# 리스트 인덱싱
var[2]

['a', 'b', 'c']

In [21]:
# 리스트에서 내부 리스트 인덱싱
var[2][0]

'a'

In [ ]:
# 리스트 슬라이싱
var = [1, 2, 3, 4, 5]
var[0:2]

In [ ]:
# 리스트 연산 + : 두 리스트를 하나로 합치기
a = [1, 2, 3]
b = [4, 5, 6]

a + b

In [ ]:
# 리스트 연산 * : 해당 리스트를 n번 반복
a = [1, 2, 3]
a * 3

In [ ]:
# 리스트에 요소 추가 append() : 리스트 마지막에 데이터 추가
var = [1, 2, 3]
var.append(4)
print(var)

In [ ]:
# append() 함수 내에 리스트 입력 시 중첩된 형태로 추가
var = [1, 2, 3]
var.append([4, 5])
print(var)

In [ ]:
# extend() : 리스트 내에 중첩된 형태가 아닌 단일 리스트로 확장
var = [1, 2, 3]
var.extend([4, 5])
print(var)

In [ ]:
# 리스트 수정: 인덱싱 이용
var = [1, 2, 3, 4, 5]
var[2] = 10
print(var)

In [ ]:
# 리스트 수정: 인덱싱 이용
var[3] = ['a', 'b', 'c']
print(var)

In [ ]:
# 리스트 수정: 슬라이싱 이용
var[0 : 2] = ['가', '나']
print(var)

In [ ]:
# 리스트 내 요소 삭제: del 명령어 / 인덱싱
var = [1, 2, 3]
del var[0]
print(var)

In [ ]:
# 리스트 내 요소 삭제: del 명령어 / 슬라이싱
var = [1, 2, 3]
del var[0:2]
print(var)

In [ ]:
# 슬라이싱으로 범위 지정 후 빈 리스트([]) 입력 시 데이터 삭제
var = [1, 2, 3]
var[0:2] = []
print(var)

In [ ]:
# remove(x) : 리스트에서 첫 번째로 나오는 x를 삭제
var = [1, 2, 3]
var.remove(1)
print(var)

In [24]:
# pop() : 리스트의 맨 마지막 요소를 반환하고 해당 요소는 삭제
var = [1, 2, 3]
var.pop()
print(var)

[1, 2]

In [25]:
# sort() : 리스트 내 데이터 정렬(오름차순)
var = [2, 4, 1, 3]
var.sort()
print(var)

[1, 2, 3, 4]

### 2.2.4 튜플
---

In [ ]:
# 튜플: 리스트와 흡사하나 소괄호(()) 이용해 생성하고, 값 수정 및 삭제 불가
#    값이 하나인 경우 값 뒤에 반드시 콤마(,) 입력
var = (1, )
print(var)

In [ ]:
# 튜플도 중첩 가능
var = (1, 2, ('a', 'b'))
print(var)

In [ ]:
# 튜플은 값 삭제 불가
var = (1, 2)
del var[0]

In [ ]:
# 튜플도 인덱싱이나 슬라이싱은 리스트와 동일
var = (1, 2, 3)
var[0]

### 2.2.5 딕셔너리
---

In [ ]:
#  딕셔너리: 대응 관계를 나타내는 자료형, 중괄호({})를 이용해 생성하며 
#     키:값 형태
var = {'key1' : 1, 'key2' : 2}
print(var)

In [ ]:
# 딕셔너리 값으로 리스트나 튜플 형태도 가능
var = {'key1' : [1, 2, 3], 'key2' : ('a', 'b', 'c')}
print(var)

In [ ]:
# 딕셔너리 키를 사용해 값 구하기
var = {'key1' : 1, 'key2' : 2, 'key3' : 3}
var['key1']

In [ ]:
# 딕셔너리 쌍 추가하기(예시: 키는 key3, 값은 3인 딕셔너리 쌍 추가)
var = {'key1': 1, 'key2': 2} 
var['key3'] = 3 
print(var)

In [ ]:
# 딕셔너리 쌍 삭제: del 명령어
del var['key1'] 
print(var)

In [ ]:
# 딕셔너리 키와 값을 한번에 구하기
#    var.keys() 입력하면 var라는 딕셔너리에서 키만을 모아 dict_keys 객체로 반환
var = {'key1': 1, 'key2': 2, 'key3': 3}
var.keys()

In [ ]:
# 결과를 list()로 감싸 주면 키값이 리스트 형태로 출력
list(var.keys())

In [ ]:
# var.values()는 var라는 딕셔너리 에서 값만을 모아 dict_values 객체 로 반환
var.values()

### 2.2.6 집합
---

In [ ]:
# set() : 집합 자료형
#    set() 내에 리스트를 입력 하면 집합이 만들어진다.
set1 = set([1, 2, 3])
print(set1)

In [ ]:
# 집합 자료형은 중복 허용 안됨, 순서 없음
set2 = set('banana')
print(set2)

In [ ]:
# 데이터 정의
s1 = set([1, 2, 3, 4])
s2 = set([3, 4, 5, 6])

In [ ]:
# union() : 합집합
s1.union(s2)

In [ ]:
# intersection() : 교집합
s1.intersection(s2)

In [ ]:
# difference() : 차집합
s1.difference(s2)

### 2.2.7 불리언(Boolean)
---

In [9]:
# 불리언 Boolean 자료형: 참 True 또는 거짓 False을 나타내는 자료형
#    True와 False의 첫 문자는 항상 대문자
var = True 
type(var)

bool

In [10]:
1 == 1

True

In [19]:
1 != 2

True

In [18]:
# bool() : True와 False를 반환 하는 함수(숫자 0은 False)
bool(0)

False

In [17]:
#  0이 아닌 숫자는 True
bool(1)

True

In [12]:
bool(2)

True

### 2.2.8 날짜와 시간
---

In [3]:
# 날짜, 시간 구하기(datetime 패키지)
import datetime 
var = datetime.datetime.now()
var

datetime.datetime(2024, 9, 13, 15, 41, 6, 516826)

In [4]:
type(var)

datetime.datetime

In [5]:
# 연도
print(var.year)

2024

In [6]:
# 월
print(var.month)

9

In [7]:
# 각 속성 한번에 출력
var.year, var.month, var.day, var.hour, var.minute, var.second, var.microsecond

(2024, 9, 13, 15, 41, 6, 516826)

In [8]:
# 요일
# 0 : 월요일, 1 : 화요일, 2 : 수요일, 3 : 목요일, 
# 4 : 금요일, 5 : 토요일, 6 : 일요일
var.weekday()

4

In [9]:
# date() : 날짜 관련 정보
var.date()

datetime.date(2024, 9, 13)

In [10]:
# time() : 시간 관련 정보
var.time()

datetime.time(15, 41, 6, 516826)

In [11]:
# strftime() : 시간 정보를 문자열 로 바꿈
var.strftime('%Y-%m-%d')

'2024-09-13'

In [13]:
# strptime() : 문자열에서 시간 정보 확인
datetime.datetime.strptime("2024-04-16 11:59:59", "%Y-%m-%d %H:%M:%S")

datetime.datetime(2024, 4, 16, 11, 59, 59)

In [14]:
# 날짜 및 시간 간격 구하기
dt1 = datetime.datetime(2022, 12, 31) 
dt2 = datetime.datetime(2021, 12, 31) 
td = dt1 - dt2 
td

datetime.timedelta(days=365)

In [15]:
# 날짜에 특정 기간 더하기(timedelta 객체 이용 - 날짜와 초단위로 연산 가능)
dt1 = datetime.datetime(2021, 12, 31) 
dt1 + datetime.timedelta(days = 1)

datetime.datetime(2022, 1, 1, 0, 0)

In [16]:
# 월 단위로 더하는 경우는 dateutil 패키지의 relativedelta 클래스를 이용
from dateutil.relativedelta import relativedelta
dt1 + relativedelta(months = 1)

datetime.datetime(2022, 1, 31, 0, 0)

In [17]:
# time 패키지의 sleep() 함수 사용 시 일정 시간 프로세스 일시정지
import datetime 
import time 

for i in range(3) : 
    print(i) 
    print(datetime.datetime.now()) 
    print('-------') 
    time.sleep(2)

0
2024-09-13 15:55:59.108033
-------
1
2024-09-13 15:56:01.108912
-------
2
2024-09-13 15:56:03.109826
-------

## 2.3 제어문
### 2.3.1 if문
---

In [18]:
# if문의 기본 구조 - 조건문 뒤에 콜론(:), 아래 실행문은 공백 4번(또는 탭)
x = 2

if x > 0:
    print('값이 0보다 큽니다.')

값이 0보다 큽니다.

In [19]:
# 조건문이 False일 때 실행할 상황은 else를 이용
x = -1

if x > 0: 
    print('값이 0보다 큽니다.') 
else: 
    print('값이 음수 입니다.')

값이 음수 입니다.

In [23]:
# 조건이 여러 개인 다중 조건을 판단하려면 if와 else 사이에 elif를 추가
# elif는 개수에 제한 없이 사용 가능
x = 3 

if x >= 10: 
    print('값이 10보다 큽니다.') 
elif x >= 0:
    print('값이 0 이상 10 미만입니다.') 
else: 
    print('값이 음수 입니다.')

값이 0 이상 10 미만입니다.

In [ ]:
# 조건문 if 와 else 로만 구성 될 경우 간단히 작성 가능
# [조건문이 True인 경우] if 조건문 else [조건문이 False인 경우]
X = 7 

'양수' if x >= 0 else '음수'

'양수'

### 2.3.2 while문
---

In [28]:
# while문(반복문) : 특정 조건을 만족하는 동안 반복해서 코드 실행
num = 1 
while num < 5: 
    print(num)
    num = num + 1

1
2
3
4

In [29]:
# while문 내부에 if문 추가 가능
num = 1 
while num < 10: 
    if num % 2 == 0:
        print (f'{num}은 짝수입니다.') 
    num = num + 1

2은 짝수입니다.
4은 짝수입니다.
6은 짝수입니다.
8은 짝수입니다.

In [30]:
# 코드 실행중 특정 조건 만족 시 멈추게 하고 싶을 경우 if문에 break를 사용
money = 1000 
while True:
    money = money - 100 
    print(f'잔액은 {money}원 입니다.') 
    
    if money <= 0: 
        break

잔액은 900원 입니다.
잔액은 800원 입니다.
잔액은 700원 입니다.
잔액은 600원 입니다.
잔액은 500원 입니다.
잔액은 400원 입니다.
잔액은 300원 입니다.
잔액은 200원 입니다.
잔액은 100원 입니다.
잔액은 0원 입니다.

### 2.3.3 for문
---

In [31]:
# for문은 while문과 동일한 반복문 이지만, 
# 무한히 반복되는 것이 아닌 정해진 횟수만큼만 반복
# for 변수 in 리스트(또는 튜플, 문자열): 
var = [1, 2, 3] 

for i in var: 
    print(i)

1
2
3

In [32]:
# for문도 if문과 함께 사용 가능
var = [10, 15, 17, 20] 

for i in var: 
    if i % 2 == 0:
        print(f'{i}는 짝수 입니다.') 
    else: 
        print(f'{i}는 홀수 입니다.')

10는 짝수 입니다.
15는 홀수 입니다.
17는 홀수 입니다.
20는 짝수 입니다.

In [ ]:
# for문은 range() 함수와 자주 사용
# range() 함수: 숫자(정수) 리스트를 자동으로 생성
for i in range(5): 
    print(i)

0
1
2
3
4

In [37]:
for i in range(0, 5): 
    print(i)

0
1
2
3
4

In [43]:
# 제곱을 구하는 예시
a = [1, 2, 3]

result = []   # 빈 리스트 생성
for i in a:    # 제곱을 구한 후 리스트에 추가(append)
    result.append(i**2) 
print(result)

[1, 4, 9]

In [ ]:
# 리스트 내포 안에 for 조건 사용시 간단히 표현 가능
# [실행 for 변수 in 리스트(또는 튜플, 문자열)]
# → 기존의 for문에서 위아래 변경 후 리스트 내에 넣어서 표현
result = [i**2 for i in a] 
print(result)

[1, 4, 9]

### 2.3.4 오류에 대한 예외 처리
---

In [ ]:
# try-except문을 이용하면 예외 처리, 즉 오류가 발생할 경우 이를 무시하고 넘어갈 수 있다.
try
    expr  # 실행하고자 하는 코드
except:
    error-handler-code  # 오류 발생 시 실행할 코드
else:
    running-code  # expr 코드가 문제가 없을 경우 실행되는 코드(생략 가능)
finally:
    cleanup-code  # 오류 여부와 관계 없이 무조건 수행할 구문(생략 가능)

In [ ]:
# 오류 발생 예제
number = [1, 2, 3, "4", 5]

for i in number:
    print(i ** 2)

1
4
9

TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'int'

In [2]:
# try-except문 예제
number = [1, 2, 3, "4", 5]

for i in number:
    try:
        print(i ** 2)
    except:
        print('Error at: ' + i)

1
4
9
Error at: 4
25

### 2.3.5 tqdm() 함수를 이용한 진행 단계 확인하기
---

In [3]:
# tqdm() 함수를 이용한 진행 단계 확인
import time
from tqdm import tqdm

for i in tqdm(range(10)):
    time.sleep(0.1)

100%|██████████| 10/10 [00:01<00:00,  9.76it/s]

## 2.4 함수
---

In [ ]:
# 함수 정의
def f(x):      # def 키워드를 통해 함수임을 선언, f는 함수명, x는 매개변수
    statement  # 실행할 코드
    return y   # 결괏값으로 y 반환 후 함수 종료

In [ ]:
# 제곱근 계산 함수 예시(매개변수 하나)
def sqrt(x):
    res = x**(1/2)
    return res

In [11]:
sqrt(4)

2.0

In [13]:
sqrt(9)

3.0

In [15]:
# 매개변수 여러개인 함수 예시
def multiply(x, y):
    res = x**y
    return res

In [ ]:
# 각 매개변수 값 직접 지정
multiply(x = 3, y = 4)

81

In [ ]:
# 인자만 입력 시 함수에서 정의한 매개변수 순서에 따라 지정
multiply(5, 2)

25

In [ ]:
# 기본값이 설정된 함수 예시
# 매개변수에 기본값을 설정하여 값을 입력하지 않을 경우 기본값이 자동 입력
def divide(x, n = 2):  # 매개변수 n에 기본값 2 설정
    res = x / n
    return(res)

In [21]:
divide(3)

1.5

In [22]:
divide(6, 3)

2.0

### 2.4.1 람다 함수
---

In [ ]:
# 람다(lambda)를 이용하여 간단히 함수 만들기
# statement : 실행할 코드
함수명 = lambda 매개변수1, 매개변수2, ...: statement

SyntaxError: invalid syntax (3138149767.py, line 2)

In [24]:
# 람다를 이용한 함수 생성 예제
divide_lam = lambda x, n: x / n

In [25]:
divide_lam(6, 3)

2.0

## 2.5 패키지 사용하기
---

In [ ]:
# 불러온 패키지 안의 내용을 살펴볼 때는 "dir(패키지 이름)" 
# 또는 "dir(패키지 별명)"을 입력
import selenium
dir(selenium)

['__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__']

In [5]:
# 하위 패키지 중에는 상위 패키지를 불러올 때 자동으로 불러오는 것이 있지만 
# 그렇지 않은 경우 수동으로 불러와야 한다.
import selenium.webdriver
dir(selenium.webdriver)[1:20]

['Chrome',
 'ChromeOptions',
 'ChromeService',
 'ChromiumEdge',
 'DesiredCapabilities',
 'Edge',
 'EdgeOptions',
 'EdgeService',
 'Firefox',
 'FirefoxOptions',
 'FirefoxProfile',
 'FirefoxService',
 'Ie',
 'IeOptions',
 'IeService',
 'Keys',
 'Proxy',
 'Remote',
 'Safari']

In [ ]:
# 패키지의 함수를 사용하기 위해서는 "패키지 이름.함수()" 또는 
# "패키지 별명.함수()"를 입력
import seaborn as sns

iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
# 패키지 로드 시 모든 함수가 아닌 특정 함수만 선택해서 로드 가능
# "from 패키지 이름 import 함수" 또는 
# "from 패키지 이름 import 함수1, 함수2, 함수3, ..."
# 특정 함수만 불러온 경우, 함수명 앞에 패키지 이름을 붙여 주지 않아도 함수 작동
# 한 번에 모든 함수를 불러오고 싶을 때는 "from 패키지이름 import *"
from seaborn import load_dataset
load_dataset('iris')

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

### 2.5.1 함수와 메서드의 차이
---

In [10]:
# 함수는 특정 기능을 수행하는 역할을 하며, 각 함수마다 나름의 기능을 가지고 있다.
# sum은 내장 함수로 합계를 구한다.
sum([1, 2])

3

In [ ]:
# 특정 패키지에서 제공하는 함수도 있다.
# pandas의 DateFrame() 함수는 데이터프레임을 만드는 역할
import pandas as pd
df = pd.DataFrame({'x':[1, 2, 3]})

df

   x
0  1
1  2
2  3

In [ ]:
# 반면 메서드는 클래스 및 객체와 연관되어 있는 함수이다.
# info() 메서드는 데이터프레임 객체의 정보를 보여준다.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      int64
dtypes: int64(1)
memory usage: 156.0 bytes

In [15]:
# 각 객체 또는 자료 구조에 따라 사용할 수 있는 메서드가 다르다. 
# info() 메서드는 데이터프레임에는 사용 가능, 리스트 객체에는 사용 불가
lst = [1, 2, 3]
lst.info()

AttributeError: 'list' object has no attribute 'info'

"함수"는 sum(), pd.DataFrame()과 같이 독립적으로 사용되는 반면,   
"메서드"는 a라는 특정 객체가 존재할 때 a.head(), a.info()와 같은 형태로 사용된다.

# 3. 데이터 분석
## 3.1 시리즈
### 3.1.1 시리즈 만들기
---

In [ ]:
# 딕셔너리를 만든 후 Series() 함수에 입력하면 시리즈 객체로 변환
# 딕셔너리의 키는 시리즈의 인덱스로 변환되고, 딕셔너리의 값들은 시리즈의 값 으로 변환
import pandas as pd

dict_data = {'a':1, 'b':2, 'c':3}
series = pd.Series(dict_data)

print(series)

a    1
b    2
c    3
dtype: int64

In [5]:
type(series)

pandas.core.series.Series

In [ ]:
# 시리즈 뒤에 .index를 입력하면 인덱스의 배열을 반환
series.index

Index(['a', 'b', 'c'], dtype='object')

In [ ]:
# 시리즈 뒤에 .values를 입력하면 값의 배열을 반환
series.values

array([1, 2, 3], dtype=int64)

In [ ]:
# 리스트를 통해 시리즈 생성
# 리스트 이용 시 인덱스는 정수형 위치 인덱스(0, 1, 2, ...)가 자동 지정
list_data = ['a', 'b', 'c']
series_2 = pd.Series(list_data)

print(series_2)

0    a
1    b
2    c
dtype: object

In [ ]:
# 리스트를 통해 시리즈 생성 후
# index 옵션에 인덱스 이름 직접 입력하여 인덱스 생성 가능
series_3 = pd.Series(list_data, index=['index1', 'index2','index3'])

print(series_3)

index1    a
index2    b
index3    c
dtype: object

### 3.1.2 원소 선택하기
---

In [57]:
# 키는 국가, 값은 수도이 시리즈 예시
capital = pd.Series({'Korea':'Seoul',
                     'Japan':'Tokyo',
                     'China':'Beijing',
                     'Indid':'New delhi',
                     'Taiwan':'Taipei',
                     'Singapore':'Singapore'
                     })

print(capital)

Korea            Seoul
Japan            Tokyo
China          Beijing
Indid        New delhi
Taiwan          Taipei
Singapore    Singapore
dtype: object

In [8]:
# 시리즈도 리스트 또는 튜플과 같이 인덱싱이나 슬라이싱을 사용해 원하는 원소 선택 가능
# 시리즈에서는 인덱스 이름을 입력하면 해당 값 출력
capital['Korea']

'Seoul'

In [13]:
# 한번에 여러개의 인덱스 입력 가능(리스트 형태([])로 입력)
capital[['Korea', 'Taiwan']]

Korea      Seoul
Taiwan    Taipei
dtype: object

In [ ]:
# 시리즈는 순서가 있기 때문에 위치를 통해서도 값 선택 가능
capital[0]

C:\Users\TG\AppData\Local\Temp\ipykernel_32748\3861522677.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  capital[0]

'Seoul'

In [ ]:
# 위치 인덱스를 리스트 형태로 입력 시 이에 해당하는 원소 출력
capital[[0, 3]]

C:\Users\TG\AppData\Local\Temp\ipykernel_32748\1449061399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  capital[[0, 3]]

Korea        Seoul
Indid    New delhi
dtype: object

In [17]:
# 리스트와 동일하게 슬라이싱 기능 사용 가능
capital[0:3]

Korea      Seoul
Japan      Tokyo
China    Beijing
dtype: object

### 3.1.3 시리즈 연산하기
---

In [ ]:
# 사칙연산 가능
# 시리즈끼리 연산시 인덱스가 같은 값끼리 연산 수행
series_1 = pd.Series([1, 2, 3])
series_2 = pd.Series([4, 5, 6])

series_1 + series_2

0    5
1    7
2    9
dtype: int64

In [ ]:
# 시리즈에 숫자를 연산하면 모든 원소에 연산이 적용
series_1 * 2

0    2
1    4
2    6
dtype: int64

## 3.2 데이터프레임
---
시리즈는 1차원 배열

데이터프레임은 2차원 배열 : 행과 열로 구성, 각 열은 시리즈 객체

---

### 3.2.1 데이터프레임 만들기와 수정하기
---

In [ ]:
# 데이터프레임은 DataFrame() 함수로 생성
# 딕셔너리를 데이터프레임으로 변환하면 키는 열이름, 값은 열의 값이 된다.
dict_data = {'col1':[1, 2, 3], 'col2':[4, 5, 6], 'col3':[7, 8, 9]}
df = pd.DataFrame(dict_data)

df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [23]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
# 리스트로 데이터프레임 생성시 열이름은 기본값인 위치 인덱스 부여
df2 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

df2

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [35]:
# 행 인덱스와 열 이름은 리스트 형태로 입력하여 직접 지정 가능
df3 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                   index=['index1', 'index2', 'index3'],
                   columns=['col1', 'col2', 'col3'])

df3

        col1  col2  col3
index1     1     2     3
index2     4     5     6
index3     7     8     9

In [36]:
# 행 인덱스와 열 이름 수정
df3.index = ['행1', '행2', '행3']
df3.columns = ['열1', '열2', '열3']

df3

    열1  열2  열3
행1   1   2   3
행2   4   5   6
행3   7   8   9

In [37]:
# 행 인덱스나 열 이름 중 원하는 부분만 선택해 변경
df3.rename(index={'행1':'첫 번째 행'}, inplace=True)
df3.rename(columns={'열1':'첫 번째 열'}, inplace=True)

df3

        첫 번째 열  열2  열3
첫 번째 행       1   2   3
행2           4   5   6
행3           7   8   9

In [ ]:
# drop() 메서드를 통해 행 또는 열 삭제
# 행 삭제 시 축(axis) 옵션으로 axis=0, 열 삭제 시 axis=1 입력
df3.drop('행3', axis=0, inplace=True)
df3.drop('열3', axis=1, inplace=True)

df3

        첫 번째 열  열2
첫 번째 행       1   2
행2           4   5

### 3.2.2 열과 행 선택하기
---

- 데이터프레임에서 열 선택 방법(시리즈 객체로 반환)
    - DataFrame['열 이름']
    - DataFrame.열 이름(열 이름이 문자열인 경우에만 가능)

- 열 선택 후 데이터프레임 형태로 반환하고자 할 경우 2중 대괄호 형태로 입력
    - DataFrame[['열 이름']]

---

In [40]:
# 샘플 데이터프레임
dict_data = {'col1':[1, 2, 3, 4], 'col2':[5, 6, 7, 8], 
             'col3':[9, 10, 11, 12], 'col4':[13, 14, 15, 16]}
df = pd.DataFrame(dict_data, index=['index1', 'index2', 'index3', 'index4'])

df

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14
index3     3     7    11    15
index4     4     8    12    16

In [ ]:
# 첫 번째 열('col1') 선택(시리즈 객체로 반환) 1
df['col1']

index1    1
index2    2
index3    3
index4    4
Name: col1, dtype: int64

In [ ]:
# 첫 번째 열('col1') 선택(시리즈 객체로 반환) 2
df.col1

index1    1
index2    2
index3    3
index4    4
Name: col1, dtype: int64

In [44]:
type(df['col1'])

pandas.core.series.Series

In [46]:
# 열 선택 후 데이터프레임 형태로 반환(2중 대괄호 사용)
df[['col1']]

        col1
index1     1
index2     2
index3     3
index4     4

In [47]:
type(df[['col1']])

pandas.core.frame.DataFrame

In [48]:
# 2개 이상의 열 추출
df[['col1', 'col2']]

        col1  col2
index1     1     5
index2     2     6
index3     3     7
index4     4     8

---

- 행 데이터 선택 시 loc, iloc 인덱서 사용(시리즈 객체로 반환)
    - loc : 인덱스 이름 기준으로 행 선택(범위 선택시 범위의 끝 행 포함)
        - DataFrame.loc['행 인덱스']
        - DataFrame.loc['행 인덱스1':'행 인덱스3']
    - iloc : 위치 인덱스 기준으로 행 선택(범위 선택시 범위의 끝 행 제외)
        - DataFrame.iloc['위치 인덱스']
        - DataFrame.iloc['위치 인덱스1':'위치 인덱스3'] = DataFrame.iloc[0:2]
- 행 선택 후 데이터프레임 형태로 반환하고자 할 경우 2중 대괄호 형태로 입력
    - DataFrame.loc[['행 인덱스']]
    - DataFrame.iloc[['위치 인덱스']]

---

In [ ]:
# 인덱스 이름 기준 첫 번째 행 선택(시리즈 객체로 반환)
df.loc['index1']

col1     1
col2     5
col3     9
col4    13
Name: index1, dtype: int64

In [ ]:
# 위치 인덱스 기준 첫 번째 행 선택(시리즈 객체로 반환)
df.iloc[0]

col1     1
col2     5
col3     9
col4    13
Name: index1, dtype: int64

In [51]:
type(df.loc['index1'])

pandas.core.series.Series

In [ ]:
# 인덱스 이름 기준 행 선택 후 데이터프레임 형태로 반환(2중 대괄호 사용)
df.loc[['index1']]

        col1  col2  col3  col4
index1     1     5     9    13

In [55]:
# 위치 인덱스 기준 행 선택 후 데이터프레임 형태로 반환(2중 대괄호 사용)
df.iloc[[0]]

        col1  col2  col3  col4
index1     1     5     9    13

In [ ]:
# 슬라이싱 사용하여 여러 행 선택(loc는 범위 선택시 범위의 끝 행 포함)
df.loc['index1':'index3']

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14
index3     3     7    11    15

In [ ]:
# 슬라이싱 사용하여 여러 행 선택(iloc는 범위 선택시 범위의 끝 행 제외)
df.iloc[0:2]

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14

- 행과 열을 동시에 입력하여 원하는 원소를 선택하는 방법
    - DataFrame.loc['행 인덱스', '열 이름']
    - DataFrame.iloc[행 위치, 열 위치]

In [ ]:
# 행과 열을 지정하여 데이터 선택
df.loc['index1', 'col1']

1

In [ ]:
# 여러 행과 열을 리스트로 지정하여 데이터 선택
df.loc[['index1', 'index3'], ['col1', 'col4']]

        col1  col4
index1     1    13
index3     3    15

In [66]:
# 슬라이싱을 이용하여 여러 행 및 열 선택
df.loc['index1':'index2', 'col1':'col3']

        col1  col2  col3
index1     1     5     9
index2     2     6    10

In [ ]:
# 위치 인덱스로 행과 열을 지정하여 데이터 선택
df.iloc[0, 0]

1

In [ ]:
# 위치 인덱스로 여러 행과 열을 리스트로 지정하여 데이터 선택
df.iloc[[0, 2], [0, 3]]

        col1  col4
index1     1    13
index3     3    15

In [ ]:
# 위치 인덱스로 슬라이싱을 이용하여 여러 행 및 열 선택(iloc는 범위 선택시 범위의 끝 행 제외)
df.iloc[0:2, 0:3]

        col1  col2  col3
index1     1     5     9
index2     2     6    10

## 3.3 데이터 불러오기 및 저장하기
---

In [ ]:
# CSV 파일 불러오기
# read_csv 참고: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
import pandas as pd

data_csv = pd.read_csv(
    'https://raw.githubusercontent.com/hyunyulhenry/quant_py/main/kospi.csv')

data_csv

           Date    Close   Ret
0    2020-01-02  2175.17 -1.02
1    2020-01-03  2176.46  0.06
2    2020-01-06  2155.07 -0.98
3    2020-01-07  2175.54  0.95
4    2020-01-08  2151.31 -1.11
..          ...      ...   ...
243  2020-12-23  2759.82  0.96
244  2020-12-24  2806.86  1.70
245  2020-12-28  2808.60  0.06
246  2020-12-29  2820.51  0.42
247  2020-12-30  2873.47  1.88

[248 rows x 3 columns]

In [6]:
# 데이터프레임 csv 파일로 저장: DataFrame.to_csv('파일이름.xlsx')
data_csv.to_csv('data.csv')

PermissionError: [Errno 13] Permission denied: 'data.csv'

In [4]:
# 엑셀 파일 불러오기
# 시트명 미입력 시 첫 번째 시트로 자동 지정, sheet_name으로 원하는 시트 지정
data_excel = pd.read_excel(
    'https://github.com/hyunyulhenry/quant_py/raw/main/kospi.xlsx', sheet_name='kospi') 

data_excel

          Date    Close   Ret
0   2020-01-02  2175.17 -1.02
1   2020-01-03  2176.46  0.06
2   2020-01-06  2155.07 -0.98
3   2020-01-07  2175.54  0.95
4   2020-01-08  2151.31 -1.11
..         ...      ...   ...
243 2020-12-23  2759.82  0.96
244 2020-12-24  2806.86  1.70
245 2020-12-28  2808.60  0.06
246 2020-12-29  2820.51  0.42
247 2020-12-30  2873.47  1.88

[248 rows x 3 columns]

In [5]:
# 데이터프레임 엑셀 파일로 저장: DataFrame.to_excel('파일이름.xlsx')
data_excel.to_excel('data.xlsx')

PermissionError: [Errno 13] Permission denied: 'data.xlsx'

## 3.4 데이터 요약 정보 및 통곗값 살펴보기
---

In [5]:
import seaborn as sns
# 타이타닉 데이터 로드
df = sns.load_dataset('titanic')
# 데이터 맨 위 5개 행 확인
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
# 데이터 맨 아래 5개 행 확인
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [7]:
# 데이터프레임 크기 확인(행 개수, 열 개수)
df.shape

(891, 15)

In [8]:
# 데이터프레임 기본 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [9]:
# 각 열의 고윳값 개수 확인
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [10]:
# 여러 열의 고윳값 개수 확인
# 원하는 열을 리스트 형태로 입력
df[['sex', 'survived']].value_counts()

sex     survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

In [11]:
# 비중으로 계산 후 인덱스 기준 정렬
# value_counts() 내에 normalize=True 입력 시 비중으로 계산
# sort_index() 메서드는 인덱스를 정렬
df[['sex', 'survived']].value_counts(normalize=True).sort_index()

sex     survived
female  0           0.090909
        1           0.261504
male    0           0.525253
        1           0.122334
Name: proportion, dtype: float64

In [12]:
# 산술 평균 계산
df['survived'].mean()

0.3838383838383838

In [13]:
# 여러 열을 동시에 산술 평균 계산
# 원하는 열을 리스트 형태로 입력
df[['survived', 'age']].mean()

survived     0.383838
age         29.699118
dtype: float64

In [14]:
# 해당열의 최솟값
df['fare'].min()

0.0

In [15]:
# 해당열의 최댓값
df['fare'].max()

512.3292

In [16]:

df['fare'].mean()

32.204207968574636

최저는 0, 최대는 512로 차이가 커 산술평균은 극단치의 영향으로 왜곡될 수 있음.   
이러한 경우 중위수(median)가 더 적합할 수 있음

In [17]:
# 중위수 계산
df['fare'].median()

14.4542

## 3.5 결측치 처리하기
---

In [18]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

NaN은 'Not a Number'의 약자로 결측치 또는 누락값을 의미

In [19]:
# info() 메서드를 통해 non-null(결측치가 아닌) 데이터 개수 확인 가능
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

**결측치 확인 방법**
 - isnull(): 결측치면 True, 유효한 데이터면 False 반환
 - notnull(): 유효한 데이터면 True, 결측치면 False 반환

In [20]:
# 결측치 확인
df.head().isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

### 3.5.1 결측치 삭제하기
---

In [21]:
# 결측치가 있는 행 또는 열 삭제
df.dropna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [22]:
# 특정 열에 결측치가 있는 경우 행 삭제
# subset으로 열 지정('axis = 0'은 행 방향으로 동작 의미)
df.dropna(subset = ['age'], axis = 0)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [23]:
# 결측치가 있는 열 삭제('axis = 1'은 행 방향으로 동작)
df.dropna(axis = 1)

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Second,man,True,no,True
887,1,1,female,0,0,30.0000,First,woman,False,yes,True
888,0,3,female,1,2,23.4500,Third,woman,False,no,False
889,1,1,male,0,0,30.0000,First,man,True,yes,True
890,0,3,male,0,0,7.7500,Third,man,True,no,True

In [24]:
# 결측치가 있는 행/열 삭제 기준치 설정
# 결측치 갯수가 thresh에 설정된 값 이상일 경우 삭제
df.dropna(axis = 1, thresh = 300)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

### 3.5.2 결측치 대체하기
---

In [25]:
# 데이터프레임 복사 후 데이터 확인
# → age 열 6번째 행 결측치
df_2 = df.copy()
df_2.head(6)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
# age열 평균값 확인
mean_age = df_2['age'].mean()
print(mean_age)

29.69911764705882

In [28]:
# fillna() 이용하여 결측치를 평균값으로 대체
# 책 원본은 df_2['age'].fillna(mean_age, inplace=True)로 되어 있으나, 
# inplace 메서드는 연쇄 할당과 관련된 잠재적인 문제와 코드의 가독성 및 
# 유지 보수성을 높이기 위해 이 매개 변수를 사용하지 않는 것을 권장
# (inplace=True는 원본 데이터프레임을 변경하겠다는 의미)
df_2['age'] = df_2['age'].fillna(mean_age)
df_2['age'].head(6)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
Name: age, dtype: float64

In [29]:
# fillna() 이용하여 결측치를 특정 문자로 변경
# embark_town의 결측치를 가장 데이터가 많은 'Southampton'으로 변경
df_2['embark_town'] = df_2['embark_town'].fillna('Southampton')
df_2['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

- 서로 이웃하고 있는 데이터끼리는 유사성을 가질 가능성이 높음(시계열 데이터 등)
- 이 경우 결측치를 바로 앞이나 뒤의 값으로 변경하는 것이 좋음

In [ ]:
# ffill()은 결측치가 있는 경우 위의 행 중 결측치가 나타나기 전 값으로 변경
df_2['deck_ffill'] = df_2['deck'].ffill()
# bfill()은 결측치가 있는 경우 아래의 행 중 결측치가 아닌 첫번째 값으로 변경
df_2['deck_bfill'] = df_2['deck'].bfill()

df_2[['deck', 'deck_ffill', 'deck_bfill']].head(12)

   deck deck_ffill deck_bfill
0   NaN        NaN          C
1     C          C          C
2   NaN          C          C
3     C          C          C
4   NaN          C          E
5   NaN          C          E
6     E          E          E
7   NaN          E          G
8   NaN          E          G
9   NaN          E          G
10    G          G          G
11    C          C          C

## 3.6 인덱스 다루기
---

In [30]:
# 예제 파일 로드
import seaborn as sns

df = sns.load_dataset('mpg')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [ ]:
# 인덱스 열 지정('name' 열)
# 책 원본은 df.set_index('name', inplace=True)로 되어 있으나, 
# inplace 메서드는 연쇄 할당과 관련된 잠재적인 문제와 코드의 가독성 및 
# 유지 보수성을 높이기 위해 이 매개 변수를 사용하지 않는 것을 권장
# (inplace=True는 원본 데이터프레임을 변경하겠다는 의미)
df = df.set_index('name')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
name,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa

In [34]:
# 인덱스를 순서대로 정렬(기본값 오름차순)
# 책 원본은 df.sort_index(inplace=True)
df = df.sort_index()
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
name,,,,,,,,
amc ambassador brougham,13.0,8,360.0,175.0,3821,11.0,73,usa
amc ambassador dpl,15.0,8,390.0,190.0,3850,8.5,70,usa
amc ambassador sst,17.0,8,304.0,150.0,3672,11.5,72,usa
amc concord,24.3,4,151.0,90.0,3003,20.1,80,usa
amc concord,19.4,6,232.0,90.0,3210,17.2,78,usa

In [35]:
# 인덱스를 내림차순으로 정렬
df = df.sort_index(ascending=False)
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
name,,,,,,,,
vw rabbit custom,31.9,4,89.0,71.0,1925,14.0,79,europe
vw rabbit c (diesel),44.3,4,90.0,48.0,2085,21.7,80,europe
vw rabbit,29.0,4,90.0,70.0,1937,14.2,76,europe
vw rabbit,41.5,4,98.0,76.0,2144,14.7,80,europe
vw pickup,44.0,4,97.0,52.0,2130,24.6,82,europe

In [ ]:
# 인덱스 재설정 
df = df.reset_index()
df.head()

## 3.7 인덱스 다루기
### 3.7.1 불리언 인덱싱
---